# Insulation Material Id Property

Source: https://www.revitapidocs.com/2026/5b0878d3-47b1-016d-5e95-12d832cc8868.htm

---

| Insulation Material Id Property |
| --- |

The Conductor Insulation Material id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId Id { get; }
```

```
Public ReadOnly Property Id As ElementId
	Get
```

```
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

```
member Id : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace